test_cases/microChannel/0.orig/air/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            uniformFixedValue;
        value           $internalField;
        uniformValue
        {
            type        expression;
            variables
            (
                "Uin = 0.5" // mean inflow/outflow velocity magnitude
                "T = 0.2"   // period, one complete inflow-outflow cycle
                "Ts = 10.0" // reducing Ts leads to a smoother alternation of the flow direction
            );
            expression  "(Uin * tanh( sin(2*pi()*time() / T) * Ts ) ) * vector(0, 0, 1)";
        }
    }

    outlet
    {
        type            zeroGradient;
    }

    air_to_solid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
