test_cases/microChannel/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    arch "LSB;label=32;scalar=64";
    class dictionary;
    location "system/air";
    object fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "(rho|rhoFinal)"
    {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-7;
        relTol 0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        FDIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance 1e-6;
        relTol 0;
    }

    "(U|h)"
        {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-7;
        relTol 0.01;
    }

    "(U|h)Final"
    {
        $U;
        tolerance 1e-7;
        relTol 0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    consistent yes;
    nCorrectors 1;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 1;
    pMinFactor   0.5;
    pMaxFactor     2;
}

relaxationFactors
{
    fields
    {
        rho             1;
        p_rgh           1;
    }
    equations
    {
        U               1;
        h               1;
    }
}




// ************************************************************************* //