test_cases/microChannel/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    arch "LSB;label=32;scalar=64";
    class dictionary;
    location "system/solid";
    object fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-06;
        relTol 0.1;
    }

    hFinal
    {
        $h;
        tolerance 1e-06;
        relTol 0;
    }
}

PIMPLE
{
}

relaxationFactors
{
    equations
    {
        h               1;
    }
}

// ************************************************************************* //